[
    {
    "plantId": 1,
    "plantName": "Snake Plant",
    "category": "Air Purifier",
    "price": 18,
    "rating": 4.8,
    "availableStock": 10,
    "careLevel": "Easy",
    "description": "The Snake Plant is a hardy indoor plant that thrives even in low light. It purifies the air by removing harmful toxins. The tall, upright leaves are deep green with yellow edges. Recognized by NASA as one of the best air-purifying plants. It produces oxygen at night, improving sleep quality. Requires watering only once a week. Allow the soil to dry completely before watering again. Highly resistant to pests and fungus. Ideal for bedrooms, offices, and living rooms. It grows slowly but lasts for years. Perfect for beginners due to its low maintenance. Its presence adds freshness and calmness to any room. A natural choice for clean and healthy air.",
    "image": "https://i.ibb.co.com/gb5XS0Dv/Snake-Plant.webp",
    "providerName": "UrbanGreen Studio"
  },
  {
    "plantId": 2,
    "plantName": "Peace Lily",
    "category": "Flowering Plant",
    "price": 22,
    "rating": 4.9,
    "availableStock": 8,
    "careLevel": "Medium",
    "description": "The Peace Lily is famous for its elegant white blooms and glossy green leaves. It removes toxins such as benzene and formaldehyde from indoor air. Its graceful flowers bring a sense of peace and beauty to any space. It can bloom even in low to moderate light. Water two to three times a week for best growth. Prefers slightly cool and shaded environments. Keep the soil moist but not soggy. Occasional misting keeps the leaves fresh. Helps regulate humidity in the room. Avoid placing it in harsh sunlight to prevent leaf burn. The mild fragrance adds calmness to the surroundings. Perfect for bedrooms or living areas. A symbol of peace, purity, and natural harmony.",
    "image": "https://i.ibb.co.com/HDZksXJ6/BOSFERN.jpg",
    "providerName": "Bloom & Grow"
  },
  {
    "plantId": 3,
    "plantName": "Aloe Vera",
    "category": "Medicinal Plant",
    "price": 15,
    "rating": 4.7,
    "availableStock": 12,
    "careLevel": "Easy",
    "description": "Aloe Vera is a medicinal plant known for its healing properties. The gel inside its leaves soothes burns, cuts, and skin irritations. It is also widely used in skincare and hair care routines. Prefers bright but indirect sunlight. Overwatering may cause root rot, so water sparingly. Grows best in warm and dry climates. It helps purify the air and increase oxygen levels indoors. Can easily propagate from leaf cuttings. Needs very little care to stay healthy. A perfect choice for busy plant lovers. Keeps the room looking green and refreshing. Adds natural wellness to your home environment. Truly a gift of nature that blends beauty and health benefits.",
    "image": "https://i.ibb.co.com/JjpFvxNK/ALOEVER.jpg",
    "providerName": "Nature's Touch"
  },
  {
    "plantId": 4,
    "plantName": "Money Plant",
    "category": "Vine Plant",
    "price": 12,
    "rating": 4.6,
    "availableStock": 14,
    "careLevel": "Easy",
    "description": "The Money Plant is a symbol of good luck and prosperity. It grows easily in both water and soil. Its fast-growing vines make it perfect for hanging planters. It can thrive even in low light conditions. Water once or twice a week for healthy growth. Filters out toxins and refreshes indoor air. According to Feng Shui, it attracts positive energy and wealth. Looks stunning near windows or corners of a room. Requires well-drained soil for best results. Avoid overwatering during winter. Occasional misting keeps the leaves shiny and fresh. Suitable for new plant enthusiasts due to its easy care. Brings beauty, peace, and positive energy to your space. A timeless favorite for homes and offices alike.",
    "image": "https://i.ibb.co.com/XkKwWmny/2.jpg",
    "providerName": "GreenAura"
  },
  {
    "plantId": 5,
    "plantName": "Spider Plant",
    "category": "Air Purifier",
    "price": 16,
    "rating": 4.8,
    "availableStock": 11,
    "careLevel": "Easy",
    "description": "The Spider Plant is a popular hanging indoor plant known for its air-purifying qualities. It removes carbon monoxide and other harmful gases. The long, narrow leaves are green with white stripes. Thrives in bright, indirect sunlight but also tolerates shade. Water once a week and keep the soil slightly moist. Propagates easily through baby offshoots. Perfect for hanging baskets and window corners. Adds freshness and greenery to any room. Great for beginners due to its simplicity. Non-toxic and safe for pets and children. Helps reduce indoor stress and fatigue. Low maintenance and grows quickly. A perfect addition to modern eco-friendly homes. Spider Plant keeps your space lively and naturally clean.",
    "image": "https://i.ibb.co.com/SwG1QCc9/Variegated-Spider-Plant-2-800x1000.jpg",
    "providerName": "Oxygen Garden"
  },
  {
    "plantId": 6,
    "plantName": "ZZ Plant",
    "category": "Low Light Plant",
    "price": 25,
    "rating": 4.9,
    "availableStock": 9,
    "careLevel": "Easy",
    "description": "The ZZ Plant is one of the most resilient indoor plants you can grow. It thrives beautifully in low light and needs very little water. The glossy green leaves have a waxy texture that gives it a rich, tropical look. Perfect for offices or bedrooms with minimal sunlight. Its thick stems store water, making it drought-tolerant. Dust the leaves occasionally to keep them shiny and healthy. It helps purify indoor air and remove toxins. Requires watering only once every two weeks. Ideal for busy or beginner plant owners. Can grow well in artificial light conditions. Avoid overwatering as the roots may rot. Propagates easily through leaf cuttings. Adds a lush, modern touch to any home. A true low-maintenance beauty for effortless greenery.",
    "image": "https://i.ibb.co.com/BHcd8zqQ/81-Nn-I-P-ONL-1.jpg",
    "providerName": "Leaf & Bloom"
  },
  {
    "plantId": 7,
    "plantName": "Areca Palm",
    "category": "Decorative Plant",
    "price": 28,
    "rating": 4.7,
    "availableStock": 7,
    "careLevel": "Medium",
    "description": "The Areca Palm is a tropical beauty that brings a fresh, natural vibe to any space. Its feathery green fronds spread gracefully, adding a resort-like charm indoors. It helps humidify dry air and improves air quality. Grows best in bright, indirect sunlight. Requires consistent watering to keep the soil slightly moist. Avoid letting it sit in standing water. Perfect for living rooms, patios, or reception areas. Adds a luxurious and lively tropical touch to interiors. The Areca Palm is pet-friendly and safe for cats and dogs. Trim older leaves regularly to maintain its elegant shape. It can grow up to several feet tall indoors. Regular misting helps it stay lush and green. A true statement plant that brings calm and elegance together.",
    "image": "https://i.ibb.co.com/G3p3Ssq1/c420a66b8133019dccec8046644ce8b2.jpg",
    "providerName": "GreenNest Supplies"
  },
  {
    "plantId": 8,
    "plantName": "Rubber Plant",
    "category": "Foliage Plant",
    "price": 30,
    "rating": 4.9,
    "availableStock": 6,
    "careLevel": "Medium",
    "description": "The Rubber Plant is known for its large, glossy leaves and bold appearance. It’s a favorite for modern home interiors. The deep green foliage adds a sophisticated and stylish look. It thrives in bright, indirect sunlight. Water moderately and allow the soil to dry slightly between watering. Helps clean indoor air by removing harmful pollutants. The leaves can be wiped occasionally to keep their natural shine. Avoid placing it in cold drafts or direct afternoon sun. It can grow tall, making it perfect as a statement floor plant. Easy to propagate through stem cuttings. Best suited for living rooms or workspaces. It grows steadily and lasts for years with proper care. A plant that symbolizes abundance, balance, and positive energy.",
    "image": "https://i.ibb.co.com/cRtv4qP/B-D-Day1-057.webp",
    "providerName": "EcoRoots Studio"
  },
  {
    "plantId": 9,
    "plantName": "Pothos Golden",
    "category": "Hanging Plant",
    "price": 14,
    "rating": 4.7,
    "availableStock": 13,
    "careLevel": "Easy",
    "description": "The Pothos Golden is a fast-growing vine known for its golden-green leaves. It’s one of the easiest and most forgiving houseplants to grow. Ideal for hanging baskets, shelves, or window corners. Thrives in both low and bright light conditions. Helps remove indoor air toxins naturally. Water when the top inch of soil feels dry. Avoid overwatering as it can cause root rot. Can grow long trailing vines over time. Trimming encourages fuller growth. Looks stunning cascading from pots or planters. Perfect for beginners and busy plant owners. Grows well in water propagation as well. Brings warmth, freshness, and life to any corner. A classic indoor favorite that never goes out of style.",
    "image": "https://i.ibb.co.com/jPzQVSY9/71j-JEl-DS1-MS-AC-UF1000-1000-QL80.jpg",
    "providerName": "UrbanLeaf"
  },
  {
    "plantId": 10,
    "plantName": "Boston Fern",
    "category": "Air Purifier",
    "price": 20,
    "rating": 4.6,
    "availableStock": 8,
    "careLevel": "Medium",
    "description": "The Boston Fern is a classic indoor plant loved for its feathery, arching fronds. It naturally cleans the air by removing indoor pollutants. Thrives in humid conditions and indirect light. Perfect for bathrooms, shaded balconies, or living rooms. Keep the soil consistently moist but not soggy. Mist regularly to maintain humidity. Avoid direct sunlight as it can scorch the leaves. Great for hanging planters or pedestal pots. Adds a vintage, cozy charm to home décor. The lush foliage creates a refreshing green atmosphere. Can be pruned to maintain shape and density. Helps reduce indoor stress and improve air quality. A timeless plant that symbolizes renewal and freshness. Beautiful, natural, and always elegant in any space.",
    "image": "https://i.ibb.co.com/zH08cw0d/peace-lily-01.jpg",
    "providerName": "Plantify Hub"
  },
  {
    "plantId": 11,
    "plantName": "Jade Plant",
    "category": "Succulent",
    "price": 19,
    "rating": 4.8,
    "availableStock": 10,
    "careLevel": "Easy",
    "description": "The Jade Plant is a popular succulent symbolizing prosperity and friendship. It features thick, oval-shaped leaves with a smooth glossy surface. Grows best in bright light or near a sunny window. Requires minimal watering as it stores moisture in its leaves. Overwatering should be avoided to prevent root damage. Known as the 'money tree' in many cultures. It’s believed to attract good fortune and success. Perfect for desks, shelves, or sunny corners. Grows slowly but lives for many years. Easy to propagate from leaf or stem cuttings. Dust the leaves occasionally for a clean look. Best suited for warm, dry indoor environments. Its compact form adds beauty to small spaces. A charming and lucky addition to any home or office.",
    "image": "https://i.ibb.co.com/ksKqFchN/miniature-jade-bonsai-tree-portulacaria-600nw-1877993242.webp",
    "providerName": "Succulent Studio"
  },
  {
  "plantId": 12,
  "plantName": "Philodendron Birkin",
  "category": "Decorative Plant",
  "price": 26,
  "rating": 4.9,
  "availableStock": 5,
  "careLevel": "Medium",
  "description": "The Philodendron Birkin is known for its elegant, creamy-white striped leaves that give a sophisticated touch to modern interiors. It thrives in bright, indirect sunlight and appreciates slightly moist soil. Its compact growth makes it perfect for desks or small corners. With consistent care, the white variegation becomes more prominent over time. This plant purifies air while adding beauty to your space. Avoid overwatering to prevent root rot. It’s ideal for plant enthusiasts who enjoy unique foliage. Mist occasionally to maintain humidity. It can adapt to indoor lighting conditions easily. Keep away from direct sun to prevent leaf burn. Fertilize monthly during growing season. The Birkin grows slowly but rewards patience with stunning foliage.",
  "image": "https://i.ibb.co.com/h1VsGrfw/img-1333-641cb6267a8a6-jpg.webp",
  "providerName": "GreenNest Exclusive"
},
{
  "plantId": 13,
  "plantName": "Fiddle Leaf Fig",
  "category": "Decorative Plant",
  "price": 35,
  "rating": 4.8,
  "availableStock": 6,
  "careLevel": "Medium",
  "description": "The Fiddle Leaf Fig features broad, violin-shaped leaves that make a bold statement in any home. It thrives in bright, filtered light and prefers a warm environment. This plant is perfect for living rooms, hallways, or office corners. Its large glossy leaves capture dust and improve air quality. Water moderately, allowing the topsoil to dry between waterings. Overwatering may cause leaf drop. Rotate occasionally to ensure even growth. Regular cleaning of leaves keeps it shiny and healthy. Fertilize monthly in spring and summer. Avoid cold drafts and sudden changes in temperature. The Fiddle Leaf Fig adds elegance and height to any decor. With care and patience, it becomes a showpiece in your home.",
  "image": "https://i.ibb.co.com/G4pRX8v0/grow-ficus-trees-1902757-recirc-129d53ad245e4b6d8c72643252f621ea.jpg",
  "providerName": "Urban Greenery"
},
{
  "plantId": 14,
  "plantName": "Calathea Orbifolia",
  "category": "Foliage Plant",
  "price": 29,
  "rating": 4.7,
  "availableStock": 7,
  "careLevel": "Medium",
  "description": "Calathea Orbifolia is admired for its large, round leaves with silver-green stripes. This tropical beauty adds calm and freshness to indoor spaces. It thrives in indirect light and high humidity. Keep soil consistently moist but not soggy. Avoid cold air or dry drafts. Its striking leaves close at night and open in the morning. Perfect for bedrooms or living rooms with low light. Use filtered water to prevent leaf spots. It’s pet-friendly and non-toxic. Regular misting keeps leaves vibrant. Fertilize every few weeks during growing months. With gentle care, it becomes a stunning indoor centerpiece. The plant symbolizes new beginnings and purity in nature.",
  "image": "https://i.ibb.co.com/Mb88RVc/bellr5-2-24-132.webp",
  "providerName": "Tropical House"
},
{
  "plantId": 15,
  "plantName": "Orchid Phalaenopsis",
  "category": "Flowering Plant",
  "price": 40,
  "rating": 4.9,
  "availableStock": 5,
  "careLevel": "Medium",
  "description": "The Orchid Phalaenopsis is celebrated for its long-lasting and graceful blooms. It brings elegance and serenity to any indoor setting. Prefers bright, indirect sunlight and moderate watering. Allow roots to dry slightly before watering again. Flowers can last for weeks with proper care. Ideal for office tables or home decoration. Its stunning petals come in various soft colors. The plant enjoys humidity and good airflow. Fertilize lightly every few weeks during flowering. Avoid overwatering to protect the roots. Repot once a year using orchid mix. Symbolizing beauty and strength, it’s a favorite gift plant. A touch of luxury and nature combined in one.",
  "image": "https://i.ibb.co.com/pBn5m6NT/how-to-grow-phalaenopsis-orchids-home-care-flowering-houseplants-332969313.webp",
  "providerName": "Blooming Art"
},
{
  "plantId": 16,
  "plantName": "Lavender",
  "category": "Herbal Plant",
  "price": 18,
  "rating": 4.6,
  "availableStock": 9,
  "careLevel": "Easy",
  "description": "Lavender is a soothing herb known for its calming fragrance and delicate purple blooms. It thrives best in bright sunlight and well-drained soil. Ideal for window sills and balconies. The scent of lavender reduces stress and promotes relaxation. Perfect for bedrooms or reading corners. Requires minimal watering once established. Avoid excess moisture to prevent root damage. Its dried flowers can be used for decoration or aromatherapy. Bees and butterflies love its aroma. Trim regularly to encourage fresh growth. The plant adds a peaceful charm to any home. It’s also great for making homemade essential oils. Lavender brings both beauty and wellness to your space.",
  "image": "https://i.ibb.co.com/pBJTHcsY/istockphoto-842983638-612x612.jpgg",
  "providerName": "Herbal Haven"
}

]
